src/Catalogs/ОСМИ_НастройкиСобытий/ОСМИ_НастройкиСобытий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОСМИ_НастройкиСобытий</name>
  <attributes>
    <name>ОбъектКонфигурации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолеОсновногоОтбора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поле</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТабличнаяЧасть</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипРегистра</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Использование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстПрограммы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Действие</name>
    <type>
      <types>EnumRef.ОСМИ_Действие</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстРассылки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстЗаголовка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстПоля</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Отборы</name>
    <attributes>
      <name>Параметр</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Enums/ОСМИ_Действие/ОСМИ_Действие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОСМИ_Действие</name>
  <enumValues>
    <name>ОтправкаДанныхКартыНаСервер</name>
  </enumValues>
  <enumValues>
    <name>ПушРассылка</name>
  </enumValues>
  <enumValues>
    <name>МаркетинговаяАкция</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаАнкетныхДанных</name>
  </enumValues>
  <enumValues>
    <name>ПереводКартыНаДругойШаблон</name>
  </enumValues>
</mdclass:Enum>

src/Documents/ОСМИ_ПушРассылка/ОСМИ_ПушРассылка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОСМИ_ПушРассылка</name>
  <attributes>
    <name>ТекстСообщения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Адресаты</name>
    <attributes>
      <name>Карта</name>
      <type>
        <types>DefinedType.ОСМИ_ДисконтнаяКарта</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ОСМИ_ДинамическаяАкция/ОСМИ_ДинамическаяАкция.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОСМИ_ДинамическаяАкция</name>
  <attributes>
    <name>ТекстСообщения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстЗаголовка</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстАкции</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Картинка</name>
    <type>
      <types>CatalogRef.ОСМИ_Картинки</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветЗаголовка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦветТекста</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦветФона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Адресаты</name>
    <attributes>
      <name>Карта</name>
      <type>
        <types>DefinedType.ОСМИ_ДисконтнаяКарта</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/ОСМИ_НастройкиСобытий/ObjectModule.bsl
Функция ПолучитьСписокКарт(Источник) Экспорт
	
	Попытка
		Результат = Новый Массив;
		Выполнить(ТекстПрограммы);
		Возврат(Результат);
	Исключение
		ЗаписьЖурналаРегистрации("ОСМИ.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки());
		Возврат Новый Массив;
	КонецПопытки;
	
КонецФункции

Процедура ОтработатьСобытие(ИсточникСобытия) Экспорт
	
	Попытка
		
		СписокКарт = ПолучитьСписокКарт(ИсточникСобытия);
		
		Если Действие = Перечисления.ОСМИ_Действие.ОтправкаДанныхКартыНаСервер Тогда
			
			Для Каждого Карта1С из СписокКарт Цикл
				
				Попытка 
					
					Карта = ОСМИ_ОбщиеСервер.ПолучитьЭлектроннуюКарту(Карта1С);
					
					Если НЕ Карта = Неопределено Тогда
						КартаОбъект = Карта.ПолучитьОбъект();
						Если НЕ КартаОбъект.УстановитьЗначенияПолей(, Истина, Карта1С) Тогда
							ВызватьИсключение "Ошибка обновления электронной карты: " + Карта;
						КонецЕсли;
						КартаОбъект.ОбменДанными.Загрузка = Истина;
						КартаОбъект.Записать();
					Иначе
						ВызватьИсключение "Не удалось получить Электронную карту для карты 1С: " + Карта1С;
					КонецЕсли;
					
				Исключение
					ЗаписьЖурналаРегистрации("ОСМИ.Ошибка", УровеньЖурналаРегистрации.Ошибка,, Ссылка,
						ОписаниеОшибки());
				КонецПопытки;
				
			КонецЦикла;
			
		ИначеЕсли Действие = Перечисления.ОСМИ_Действие.ПереводКартыНаДругойШаблон Тогда
			
			Для Каждого ДанныеКарты1С из СписокКарт Цикл
				
				Карта = ОСМИ_ОбщиеСервер.ПолучитьЭлектроннуюКарту(ДанныеКарты1С.Карта);
				
				Попытка
					
					Если НЕ Карта = Неопределено Тогда

						Если ТипЗнч(ДанныеКарты1С.Шаблон) = Тип("Строка") Тогда

							ШаблонСсылка = Справочники.ОСМИ_ШаблоныЭлектронныхКарт.НайтиПоНаименованию(СокрЛП(ДанныеКарты1С.Шаблон));
							Если НЕ ЗначениеЗаполнено(ШаблонСсылка) Тогда
								ВызватьИсключение "Неизвестное наименование шаблона электронной карты";
							КонецЕсли;
							ШаблонНаименование = ДанныеКарты1С.Шаблон;
							
						ИначеЕсли ТипЗнч(ДанныеКарты1С.Шаблон) = Тип("СправочникСсылка.ОСМИ_ШаблоныЭлектронныхКарт") Тогда
							
							Если НЕ ЗначениеЗаполнено(ДанныеКарты1С.Шаблон) Тогда
								ВызватьИсключение "Неизвестный шаблон электронной карты: " + Карта;
							КонецЕсли;
							ШаблонСсылка = ДанныеКарты1С.Шаблон;
							ШаблонНаименование = ДанныеКарты1С.Шаблон.Наименование;
							
						Иначе
							ВызватьИсключение "Неизвестный шаблон электронной карты: " + Карта;
						КонецЕсли;

						Если Карта.Шаблон <> ШаблонСсылка Тогда

							Если НЕ ОСМИ_РаботаСAPI.СменитьШаблон(СокрЛП(КартаОбъект.Код), СокрЛП(ШаблонНаименование)).Успех Тогда
								ВызватьИсключение "Ошибка смены шаблона электронной карты: " + Карта;
							КонецЕсли;
							
							КартаОбъект = Карта.ПолучитьОбъект();
							КартаОбъект.Шаблон = ШаблонСсылка;
							КартаОбъект.ОбменДанными.Загрузка = Истина;
							КартаОбъект.Записать();
							
						КонецЕсли;
						
					Иначе
						ВызватьИсключение "Не удалось получить Электронную карту для карты 1С: " + ДанныеКарты1С.Карта;
					КонецЕсли;
					
				Исключение
					ЗаписьЖурналаРегистрации("ОСМИ.Ошибка", УровеньЖурналаРегистрации.Ошибка,, Ссылка,
						ОписаниеОшибки());
				КонецПопытки;
					
			КонецЦикла;
			
		ИначеЕсли Действие = Перечисления.ОСМИ_Действие.ПушРассылка Тогда
			
			ПушРассылка = Документы.ОСМИ_ПушРассылка.СоздатьДокумент();
			
			Для Каждого Карта1С из СписокКарт Цикл
				Стр = ПушРассылка.Адресаты.Добавить();
				Стр.Карта = Карта1С;
			КонецЦикла;
			Если ПушРассылка.Адресаты.Количество() > 0 Тогда 
				ПушРассылка.Дата = ТекущаяДата();
				ПушРассылка.ТекстСообщения = ТекстРассылки;
				ПушРассылка.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
			
		ИначеЕсли Действие = Перечисления.ОСМИ_Действие.МаркетинговаяАкция Тогда
			
			МаркетинговаяАкция =  Документы.ОСМИ_ДинамическаяАкция.СоздатьДокумент();
			
			Для Каждого Карта1С из СписокКарт Цикл
				Стр = МаркетинговаяАкция.Адресаты.Добавить();
				Стр.Карта = Карта1С;
			КонецЦикла;
			Если ПушРассылка.Адресаты.Количество() > 0 Тогда 
				МаркетинговаяАкция.Дата = ТекущаяДата();
				МаркетинговаяАкция.ТекстСообщения = ТекстРассылки;
				МаркетинговаяАкция.ТекстАкции = ТекстПоля;
				МаркетинговаяАкция.ТекстЗаголовка = ТекстЗаголовка;
				МаркетинговаяАкция.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
			
		КонецЕсли;
		
	Исключение
		ЗаписьЖурналаРегистрации("ОСМИ.Ошибка", УровеньЖурналаРегистрации.Ошибка,, Ссылка,
			ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

Функция СоздатьПолучитьРегламентноеЗадание() Экспорт
	
	Попытка

		Задания = РегламентныеЗадания.ПолучитьРегламентныеЗадания(Новый Структура("Метаданные, Предопределенное, Ключ",
			Метаданные.РегламентныеЗадания.ОСМИ_РегламентноеЗадание, Ложь, Ссылка.УникальныйИдентификатор()));
		
		Если Задания.Количество() > 0 тогда
			Задание = Задания[0];
		Иначе                                     
			Задание = РегламентныеЗадания.СоздатьРегламентноеЗадание(Метаданные.РегламентныеЗадания.ОСМИ_РегламентноеЗадание);
			УстановитьПараметрыРегламентногоЗадания(Задание);
		КонецЕсли;
		
		Возврат Задание;
		
	Исключение
		ЗаписьЖурналаРегистрации("ОСМИ.Ошибка", УровеньЖурналаРегистрации.Ошибка,, Ссылка,
			ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

Процедура УстановитьПараметрыРегламентногоЗадания(Задание = Неопределено, Расписание = Неопределено) Экспорт
	
	Если Задание = Неопределено Тогда
		Задание = СоздатьПолучитьРегламентноеЗадание();
		Если Задание = Неопределено Тогда
			Сообщить("Ошибка получения регламентного задания!");
		КонецЕсли;
	КонецЕсли;
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(Новый Структура("НастройкаСобытия", Ссылка));
	
	Задание.Параметры = МассивПараметров;
	Задание.Ключ = Ссылка.УникальныйИдентификатор();	
	Задание.Использование = Использование;
	Задание.Наименование = "Обработка событий ОСМИ: " + Наименование;
	Если Расписание <> Неопределено Тогда
		Задание.Расписание = Расписание;
	КонецЕсли;
	Задание.Записать();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)

	Попытка
		
		Задания = РегламентныеЗадания.ПолучитьРегламентныеЗадания(Новый Структура("Метаданные, Предопределенное, Ключ",
			Метаданные.РегламентныеЗадания.ОСМИ_РегламентноеЗадание, Ложь, Ссылка.УникальныйИдентификатор()));
		
		Если Задания.Количество() > 0 тогда
			УстановитьПараметрыРегламентногоЗадания(Задания[0]);
		КонецЕсли;
		
	Исключение
		ЗаписьЖурналаРегистрации("ОСМИ.Ошибка", УровеньЖурналаРегистрации.Ошибка,, Ссылка,
			ОписаниеОшибки());
	КонецПопытки;

КонецПроцедуры
